/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*\
            setup Loop for serial
\*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*/
 void menuTest() {

  Serial.println("Старт тестирования");
  Serial.println(" ");
  Serial.println("В мониторе надо выставить NL" );
  Serial.println(" ");
  Serial.println("Если команда i2c, то запускается I2C Scanner");
  Serial.println("Если команда ds18, то запускается ds18 Scanner");
  Serial.println(" ");

}
/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*/
